app/controllers/applications_controller.rb

SELECT "applications".* FROM "applications" WHERE "applications"."pin_id" = ?  [["pin_id", 1]]
SELECT "applications".* FROM "applications"
---
  def index
    if params[:pin_id].present?
      @applications = Application.where(pin_id: params[:pin_id])
    else
      @applications = Application.all

SELECT  "pins".* FROM "pins" WHERE "pins"."pin_id" IS NULL  ORDER BY "pins"."id" ASC LIMIT 1
SELECT "applications".* FROM "applications" WHERE "applications"."pin_id" = ? AND "applications"."user_id" = ?  [["pin_id", 2], ["user_id", 1]]
INSERT INTO "applications" ("pin_id", "user_id", "information", "reached", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["pin_id", 1], ["user_id", 1], ["information", "ola"], ["reached", "f"], ["created_at", "2015-08-23 01:14:26.299077"], ["updated_at", "2015-08-23 01:14:26.299077"]]
---
  def create
    @application = Application.new(application_params)
    @application.reached = false

    pin = Pin.find(params[:application][:pin_id])
    if pin.present? && authentificate_user_with_token_POST(params[:application][:user_id],params[:user_token])
      if not pin.existeSolicitud?(params[:application][:user_id])
        respond_to do |format|
          if @application.save