app/controllers/pins_controller.rb

  def index
    if params[:user_id].present?
      @pins = Pin.where(user_id: params[:user_id])
    else
      @pins = Pin.all
---
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = ?  [["user_id", 2]]
SELECT "pins".* FROM "pins"

  def create
    @pin = Pin.new(pin_params)

    if authentificate_user_with_token_POST(params[:pin][:user_id],params[:user_token])
      respond_to do |format|
        if @pin.save
---
INSERT INTO "pins" ("user_id", "title", "latitude", "longitude", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "ola"], ["latitude", 1.0], ["longitude", 1.0], ["course_id", 1], ["created_at", "2015-08-23 01:07:25.179232"], ["updated_at", "2015-08-23 01:07:25.179232"]]