app/controllers/token_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1"]]
---
   def create
    fbuid = params[:fbuid]
    fbsecrettoken = params[:fbsecrettoken]

    if request.format != :json
      render :status => 406, :json => { :message => 'La consulta debe ser en formato .json' }
      return
    end

    if fbuid.nil? or fbsecrettoken.nil?
      render :status => 400, :json => { :message => 'La consulta necesita del fb id y del token secreto' }
      return
    end

    @user = User.find_by_uid(fbuid)