app/controllers/universities_controller.rb

SELECT "universities".* FROM "universities"
---
  def index
    @universities = University.all

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_university
      @university = University.find(params[:id])