app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    if not params['id'].nil?
      @user = User.find(params[:id])

INSERT INTO "users" ("email", "provider", "encrypted_password", "role", "authentication_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2015-08-20 16:14:52.335033"], ["current_sign_in_at", "2015-08-20 16:15:04.236091"], ["sign_in_count", 3], ["updated_at", "2015-08-20 16:15:04.236791"], ["id", 1]]
---
    @user.uid = uid

    respond_to do |format|
      if @user.save